failure1NACA2415/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 4.9129;

boundaryField
{
    //- Set patchGroups for constraint patches
    //#includeEtc "caseDicts/setConstraintTypes"

    //- Define inlet conditions
    //#include "include/fixedInlet"

    inlet
    {
	type 		fixedValue;
	value 		uniform 4.9129;
    }

    outlet
    {
        type            zeroGradient;
    }

    lowerWall
    {
        type            slip;
       
    }

    wing
    {
        type            kqRWallFunction;
        value           uniform 4.9129;
    }

    #include "include/frontBackUpperPatches"
}


// ************************************************************************* //
